Revit 2025 API
IFCImportAction Enumeration
 The action of the IFC import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum IFCImportAction
Public Enumeration IFCImportAction
public enum class IFCImportAction
type IFCImportAction
Members
Member name | Value | Description
Open | 0 |  Open a new project file.
Link | 1 |  Link into an existing project file.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace